src/main/resources/webServiceRequestXmls/DeviceSale.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:elt="http://eltws.map.ecs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <elt:callExtAPIDeviceSale>
         <!--Optional:-->
         <extAPIDeviceSaleReq>
            <!--Optional:-->
            <currentZipCode>411006</currentZipCode>
            <!--Optional:-->
            <permanentAddress1>Pune</permanentAddress1>
            <!--Optional:-->
            <permanentAddress2></permanentAddress2>
            <!--Optional:-->
            <officeCountry>356</officeCountry>
            <!--Optional:-->
            <vipFlag></vipFlag>
            <!--Optional:-->
            <travelPurpose></travelPurpose>
            <!--Optional:-->
            <birthCity>PUN</birthCity>
            <!--Optional:-->
            <languagePreference>en</languagePreference>
            <!--Optional:-->
            <education>4</education>
            <!--Optional:-->
            <officeAddress4></officeAddress4>
            <!--Optional:-->
            <officeExt></officeExt>
            <!--Optional:-->
            <officeContactNo1></officeContactNo1>
            <!--Optional:-->
            <officeContactNo2></officeContactNo2>
            <!--Optional:-->
            <currentAddress4></currentAddress4>
            <!--Optional:-->
            <permanentAddress4></permanentAddress4>
            <!--Optional:-->
            <permanantContactNo1>843843834</permanantContactNo1>
            <!--Optional:-->
            <permanantContactNo2></permanantContactNo2>
            <!--Optional:-->
            <maidenName>Test</maidenName>
            <!--Optional:-->
            <gender>M</gender>
            <!--Optional:-->
            <birthDate>19900311</birthDate>
            <!--Optional:-->
            <birthCountry>356</birthCountry>
            <!--Optional:-->
            <nationalityCode>356</nationalityCode>
            <!--Optional:-->
            <preferredMailingAddress>C</preferredMailingAddress>
            <!--Optional:-->
            <currentAddress1>Pune</currentAddress1>
            <!--Optional:-->
            <currentAddress2>Add2</currentAddress2>
            <!--Optional:-->
            <currentAddress3></currentAddress3>
            <!--Optional:-->
            <currentCity>PUN</currentCity>
            <!--Optional:-->
            <currentState>MAH</currentState>
            <!--Optional:-->
            <currentCountry>356</currentCountry>
            <!--Optional:-->
            <passCode></passCode>
            <!--Optional:-->
            <transactionCode>316</transactionCode>
            <!--Optional:-->
            <title>1</title>
            <!--Optional:-->
            <firstName>Looping</firstName>
            <!--Optional:-->
            <middleName1>Closed</middleName1>
            <!--Optional:-->
            <middleName2></middleName2>
            <!--Optional:-->
            <lastName>rester</lastName>
            <!--Optional:-->
            <maritalStatus>1</maritalStatus>
            <!--Optional:-->
            <travelType></travelType>
            <!--Optional:-->
            <travelStartDate></travelStartDate>
            <!--Optional:-->
            <travelEndDate></travelEndDate>
            <!--Optional:-->
            <travelCountry></travelCountry>
            <!--Optional:-->
            <officeMobileISDN></officeMobileISDN>
            <!--Optional:-->
            <officeMobNo></officeMobNo>
            <!--Optional:-->
            <officeEmailID></officeEmailID>
            <!--Optional:-->
            <employeeID></employeeID>
            <!--Optional:-->
            <designation></designation>
            <!--Optional:-->
            <department></department>
            <!--Optional:-->
            <jobTenureYear></jobTenureYear>
            <!--Optional:-->
            <joiningDate></joiningDate>
            <!--Optional:-->
            <employmentStatus>1</employmentStatus>
            <!--Optional:-->
            <registeredMobileISDN>123</registeredMobileISDN>
            <!--Optional:-->
            <registerForDNCR></registerForDNCR>
            <!--Optional:-->
            <smsAlert>N</smsAlert>
            <!--Optional:-->
            <emailAlert>N</emailAlert>
            <!--Optional:-->
            <statementCopyMode>E</statementCopyMode>
            <!--Optional:-->
            <kycStatus></kycStatus>
            <!--Optional:-->
            <kycRemark></kycRemark>
           <!--Optional:-->
            <legalID1PlaceOfIssuance></legalID1PlaceOfIssuance>
            <!--Optional:-->
            <legalID1ExpiryDate></legalID1ExpiryDate>
            <!--Optional:-->
            <legalID2PlaceOfIssuance></legalID2PlaceOfIssuance>
            <!--Optional:-->
            <legalID2ExpiryDate></legalID2ExpiryDate>
            <!--Optional:-->
            <legalID3PlaceOfIssuance></legalID3PlaceOfIssuance>
            <!--Optional:-->
            <legalID4PlaceOfIssuance></legalID4PlaceOfIssuance>
            <!--Optional:-->
            <legalID4ExpiryDate></legalID4ExpiryDate>
            <!--Optional:-->
            <legalID3ExpiryDate></legalID3ExpiryDate>
            <!--Optional:-->
            <officeZipCode>411006</officeZipCode>
            <!--Optional:-->
            <employerName>MC</employerName>
            <!--Optional:-->
            <applicationType>1</applicationType>
            <!--Optional:-->
            <programCode>PCLOSE</programCode>
            <!--Optional:-->
            <primaryDeviceNumber></primaryDeviceNumber>
            <!--Optional:-->
            <occupationType></occupationType>
            <!--Optional:-->
            <employerType></employerType>
            <!--Optional:-->
            <currentContactNo1>392828322</currentContactNo1>
            <!--Optional:-->
            <currentContactNo2></currentContactNo2>
            <!--Optional:-->
            <permanentAddress3></permanentAddress3>
            <!--Optional:-->
            <permanentCity>PUN</permanentCity>
            <!--Optional:-->
            <permanentState>MAH</permanentState>
            <!--Optional:-->
            <permanentCountry>356</permanentCountry>
            <!--Optional:-->
            <permanentZipCode>411006</permanentZipCode>
            <!--Optional:-->
            <officeAddress1></officeAddress1>
            <!--Optional:-->
            <officeAddress2></officeAddress2>
            <!--Optional:-->
            <userId>772273</userId>
            <!--Optional:-->
            <faxNumber></faxNumber>
            <!--Optional:-->
            <registeredMobileNumber>2398211288</registeredMobileNumber>
            <!--Optional:-->
            <registeredeMailId>MITHUN.KUMAR2@MASTERCARD.COM</registeredeMailId>
            <!--Optional:-->
            <legalIdType1></legalIdType1>
            <!--Optional:-->
            <legalId1></legalId1>
            <!--Optional:-->
            <legalIdType2></legalIdType2>
            <!--Optional:-->
            <legalId2></legalId2>
            <!--Optional:-->
            <legalIdType3></legalIdType3>
            <!--Optional:-->
            <legalId3></legalId3>
            <!--Optional:-->
            <legalIdType4></legalIdType4>
            <!--Optional:-->
            <legalId4></legalId4>
            <!--Optional:-->
            <clientDataField1></clientDataField1>
            <!--Optional:-->
            <clientDataField2></clientDataField2>
            <!--Optional:-->
            <clientDataField3></clientDataField3>
            <!--Optional:-->
            <clientDataField4></clientDataField4>
            <!--Optional:-->
            <clientDataField5></clientDataField5>
            <!--Optional:-->
            <clientAmountField1></clientAmountField1>
            <!--Optional:-->
            <clientAmountField2></clientAmountField2>
            <!--Optional:-->
            <clientAmountField3></clientAmountField3>
            <!--Optional:-->
            <clientAmountField4></clientAmountField4>
            <!--Optional:-->
            <clientAmountField5></clientAmountField5>
            <!--Optional:-->
            <clientDateField1></clientDateField1>
            <!--Optional:-->
           <clientDateField2></clientDateField2>
            <!--Optional:-->
            <clientDateField3></clientDateField3>
            <!--Optional:-->
            <officeAddress3>PUNE</officeAddress3>
            <!--Optional:-->
            <officeCity>PUN</officeCity>
            <!--Optional:-->
            <officeState>MAH</officeState>
            <!--Optional:-->
            <clientDateField4></clientDateField4>
            <!--Optional:-->
            <clientDateField5></clientDateField5>
            <!--Optional:-->
            <walletDataField1></walletDataField1>
            <!--Optional:-->
            <walletDataField2></walletDataField2>
            <!--Optional:-->
            <walletDataField3></walletDataField3>
            <!--Optional:-->
            <walletDataField4></walletDataField4>
            <!--Optional:-->
            <walletDataField5></walletDataField5>
            <!--Optional:-->
            <walletDateField1></walletDateField1>
            <!--Optional:-->
            <walletDateField2></walletDateField2>
            <!--Optional:-->
            <walletDateField3></walletDateField3>
            <!--Optional:-->
            <walletDateField4></walletDateField4>
            <!--Optional:-->
            <walletDateField5></walletDateField5>
            <!--Optional:-->
            <walletAmountField1></walletAmountField1>
            <!--Optional:-->
            <walletAmountField2></walletAmountField2>
            <!--Optional:-->
            <walletAmountField3></walletAmountField3>
            <!--Optional:-->
            <walletAmountField4></walletAmountField4>
            <!--Optional:-->
            <walletAmountField5></walletAmountField5>
            <!--Optional:-->
            <deviceAmountField1></deviceAmountField1>
            <!--Optional:-->
            <deviceAmountField2></deviceAmountField2>
            <!--Optional:-->
            <deviceAmountField3></deviceAmountField3>
            <!--Optional:-->
            <deviceAmountField4></deviceAmountField4>
            <!--Optional:-->
            <deviceAmountField5></deviceAmountField5>
            <!--Optional:-->
            <deviceDataField1></deviceDataField1>
            <!--Optional:-->
            <deviceDataField2></deviceDataField2>
            <!--Optional:-->
            <deviceDataField3></deviceDataField3>
            <!--Optional:-->
            <deviceDataField4></deviceDataField4>
            <!--Optional:-->
            <deviceDataField5></deviceDataField5>
            <!--Optional:-->
            <deviceDateField1></deviceDateField1>
            <!--Optional:-->
            <deviceDateField2></deviceDateField2>
            <!--Optional:-->
            <deviceDateField3></deviceDateField3>
            <!--Optional:-->
            <deviceDateField4></deviceDateField4>
            <!--Optional:-->
            <deviceDateField5></deviceDateField5>
            <!--Optional:-->
            <sessionKey>31JZYKFSW3FTTPNYFXYP1AV</sessionKey>
            <!--Optional:-->
            <transactionCounter>555599093</transactionCounter>
            <!--Optional:-->
            <channel>31</channel>
            <!--Optional:-->
            <formFactorType>CRD</formFactorType>
            <!--Optional:-->
            <formFactor>7121110010000111</formFactor>
            <!--Optional:-->
            <passCodeFlag>N</passCodeFlag>
         </extAPIDeviceSaleReq>
      </elt:callExtAPIDeviceSale>
   </soapenv:Body>
</soapenv:Envelope>